app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "author", "price", "published_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "hello world"], ["author", "just"], ["price", 234.0], ["published_date", "2020-01-30"], ["created_at", "2022-01-31 00:00:50.434318"], ["updated_at", "2022-01-31 00:00:50.434318"]]